
program SumOfNumbers;
var
  num,sum: integer;
  a,b,c:integer;
  n: integer; //не удалять!!! нужна для работы меню
  // раздел для объявления переменных. 
Begin
        // не УДАЛЯТЬ!! Организовано меню
     writeln ('введите номер задачи');
     Readln(n);
case n of

//вычисление функции вариант 1
1:
  Begin 
    sum:=0;
     writeln ('Введите числа для вычисления:');
      repeat
      write('Введите число:');
      readln(num);
      
      sum:=sum+num;
      until num = 0;
      writeln('Сумма введённых чисел:', sum);
  end;

//вычисление функции вариант 2
2:
  Begin 
       writeln('введите 3 числа');
       readln(a,b,c);
       if (a=b) and (b=c) then writeln('равны')
       else writeln('не равны');
       readln;
  end;
  //вычисление функции вариант 3
3:
  Begin 
    // сюда пишем код программы варианта
  end;
  //вычисление функции вариант 4
4:
  Begin 
    // сюда пишем код программы варианта
  end;
  //вычисление функции вариант 5
5:
  Begin 
    // сюда пишем код программы варианта
  end;
//вычисление функции вариант 1
6:
  Begin 
    // сюда пишем код программы варианта
  end;
  end;
  end.